## Instructions to students
This challenge is designed to determine how much you have learned so far and will test your knowledge on SQL.

The answers for this challenge should be selected on Athena for each corresponding multiple-choice question. The questions are included in this notebook and are numbered according to the Athena questions. The options for each question have also been included.

Do not add or remove cells in this notebook. Do not edit or remove the %%sql comment as it is required to run each cell.

Good luck!

In [1]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook. 
# If you get an error here, make sure that mysql and pymysql are installed correctly. 

%load_ext sql

In [2]:
# Establish a connection to the local database using the '%sql' magic command.
# Replace 'password' with our connection password and `db_name` with our database name. 
# If you get an error here, please make sure the database name or password is correct.

%sql sqlite:///TMDB-a-4006.db

## Question 1
Who won the Oscar for “Actor in a Leading Role” in 2015?

(Hint: The winner is indicated as '1.0'.)

Options:

Micheal Fassbender
Natalie Portman
Leonardo DiCaprio
Eddie Redmayne

In [3]:
%%sql

SELECT  name
FROM Oscars
WHERE year = '2015'
  AND award = 'Actor in a Leading Role'
  AND winner = '1.0';

 * sqlite:///TMDB-a-4006.db
Done.

[('Leonardo DiCaprio',)]

In [4]:
%%sql
SELECT COUNT(DISTINCT award) AS unique_awards
FROM Oscars;

 * sqlite:///TMDB-a-4006.db
Done.

[(114,)]

In [5]:
%%sql
SELECT COUNT(movie_id) AS movie_count
FROM Movies
WHERE title LIKE '%Spider%';

 * sqlite:///TMDB-a-4006.db
Done.

[(9,)]

In [6]:
%%sql
SELECT COUNT(DISTINCT T1.movie_id) AS movie_count
FROM Movies AS T1
INNER JOIN Genremap AS T2 ON T1.movie_id = T2.movie_id
INNER JOIN Genres AS T3 ON T2.genre_id = T3.genre_id
INNER JOIN Keywordmap AS T4 ON T1.movie_id = T4.movie_id
INNER JOIN Keywords AS T5 ON T4.keyword_id = T5.keyword_id
WHERE T3.genre_name = 'Thriller'
  AND T5.keyword_name LIKE '%love%';

 * sqlite:///TMDB-a-4006.db
Done.

[(48,)]

In [7]:
%%sql
SELECT COUNT(movie_id) AS movie_count
FROM Movies
WHERE release_date BETWEEN '2006-08-01' AND '2009-10-01'
  AND popularity > 40
  AND budget < 50000000;

 * sqlite:///TMDB-a-4006.db
Done.

[(29,)]

In [8]:
%%sql
SELECT COUNT(DISTINCT T2.characters) AS unique_characters
FROM Actors AS T1
INNER JOIN Casts AS T2 ON T1.actor_id = T2.actor_id
WHERE T1.actor_name = 'Vin Diesel';

 * sqlite:///TMDB-a-4006.db
Done.

[(16,)]

In [9]:
%%sql
SELECT T3.genre_name
FROM Movies AS T1
INNER JOIN Genremap AS T2 ON T1.movie_id = T2.movie_id
INNER JOIN Genres AS T3 ON T2.genre_id = T3.genre_id
WHERE T1.title = 'The Royal Tenenbaums';

 * sqlite:///TMDB-a-4006.db
Done.

[('Drama',), ('Comedy',)]

In [10]:
%%sql
SELECT
    T3.production_company_name,
    AVG(T1.popularity) AS avg_popularity
FROM
    Movies AS T1
INNER JOIN
    productioncompanymap AS T2 ON T1.movie_id = T2.movie_id
INNER JOIN
    productioncompanies AS T3 ON T2.production_company_id = T3.production_company_id
GROUP BY
    T3.production_company_name
ORDER BY
    avg_popularity DESC
LIMIT 3;

 * sqlite:///TMDB-a-4006.db
Done.

[("The Donners' Company", 514.569956),
 ('Bulletproof Cupid', 481.098624),
 ('Kinberg Genre', 326.92099900000005)]

In [11]:
%%sql
SELECT COUNT(actor_id) AS actor_count
FROM Actors
WHERE gender = 1
  AND actor_name LIKE 'N%';

 * sqlite:///TMDB-a-4006.db
Done.

[(355,)]

In [12]:
%%sql
SELECT T3.genre_name
FROM Movies AS T1
INNER JOIN Genremap AS T2 ON T1.movie_id = T2.movie_id
INNER JOIN Genres AS T3 ON T2.genre_id = T3.genre_id
GROUP BY T3.genre_name
ORDER BY AVG(T1.popularity) ASC
LIMIT 1;

 * sqlite:///TMDB-a-4006.db
Done.

[('Foreign',)]